tap "asmvik/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "homebrew/services"
tap "launchdarkly/tap"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "stripe/stripe-cli"
tap "supabase/tap"
tap "wix-incubator/brew", "https://github.com/wix-incubator/homebrew-brew.git"
# Cryptography and SSL/TLS Toolkit
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Tool for generating GNU Standards-compliant Makefiles
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# XML-based font configuration API for X Windows
# XML-based font configuration API for X Windows
brew "fontconfig"
# Generic library support script
# Generic library support script
brew "libtool"
# Postgres C API library
# Postgres C API library
brew "libpq"
# Dependency Manager for PHP
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
# GNU File, Shell, and Text utilities
brew "coreutils"
# Top-like interface for container metrics
# Top-like interface for container metrics
brew "ctop"
# Modern, maintained replacement for ls
# Modern, maintained replacement for ls
brew "eza"
# YAML Parser
# YAML Parser
brew "libyaml"
# Easiest way to build and release mobile apps
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Library for manipulating fonts
brew "fonttools"
# Command-line fuzzy finder written in Go
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Audit git repos for secrets
# Audit git repos for secrets
brew "gitleaks"
# Improved top (interactive process viewer)
# Improved top (interactive process viewer)
brew "htop"
# Get events and tasks from the macOS calendar database
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Tools and libraries to manipulate images in select formats
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# X.509 and CMS library
# X.509 and CMS library
brew "libksba"
# Remote terminal application
# Remote terminal application
brew "mosh"
# Package compiler and linker metadata toolkit
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
# Fast, disk space efficient package manager
brew "pnpm"
# Theme for zsh
# Theme for zsh
brew "powerlevel10k"
# Python version management
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
# Ruby version manager
brew "rbenv"
# CLI for extracting streams from various websites to a video player
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Open source continuous file synchronization application
brew "syncthing", restart_service: :changed
# Easiest, most secure way to use WireGuard and 2FA
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Programmatically correct mistyped console commands
# Programmatically correct mistyped console commands
brew "thefuck"
# Official tldr client written in Rust
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Watch files and take action when they change
# Watch files and take action when they change
brew "watchman"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# JavaScript package manager
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Supabase CLI
brew "supabase/tap/supabase", trusted: true
# Enable Windows-like alt-tab
# Enable Windows-like alt-tab
cask "alt-tab"
cask "font-hack-nerd-font"
# Open-source keystroke visualiser
# Open-source keystroke visualiser
cask "keycastr"
# Intercept, modify, replay, save HTTP/S traffic
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Reverse proxy, secure introspectable tunnels to localhost
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok/ngrok/ngrok"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# System monitor for the menu bar
# System monitor for the menu bar
cask "stats"
# Mesh VPN based on WireGuard
# Mesh VPN based on WireGuard
cask "tailscale-app"
# OpenJDK distribution from Azul
# OpenJDK distribution from Azul
cask "zulu@17"
uv "serena-agent"
npm "agent-browser"
npm "corepack"
npm "vercel"
